test/load/scenarios.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 1
      arrivalRate: 1
  processor: './load-test-helper.js'

scenarios:
  - flow:
      - get:
          url: '/'
      - think: 5
      - get:
          url: '/start'
      - think: 1
      - get:
          url: '/apply/first-time/new-eligibility'
      - think: 1
      - get:
          url: '/apply/first-time/new-eligibility/1983-08-08'
      - think: 1
      - get:
          url: '/apply/first-time/new-eligibility/1983-08-08/child'
      - think: 1
      - get:
          url: '/apply/first-time/new-eligibility/1983-08-08/child/income-support'
          capture:
            selector: "input[name=_csrf]"
            as: 'token'
      - think: 1
      - post:
          url: '/apply/first-time/new-eligibility/1983-08-08/child/income-support'
          json:
            FirstName: 'Test'
            LastName: 'Testing'
            dob-day: 9
            dob-month: 9
            dob-year: 1984
            PrisonerNumber: A1234BC
            NameOfPrison: Hewell
            _csrf: '{{ token.value }}'
          capture:
            header: 'location'
            as: 'aboutYouUrl'
      - think: 3
      - get:
          url: '{{ aboutYouUrl }}'
          capture:
            selector: "input[name=_csrf]"
            as: 'token'
      - post:
          url: '{{ aboutYouUrl }}'
          json:
          FirstName: John
          LastName: Tester
          NationalInsuranceNumber: JL243522B
          HouseNumberAndStreet: '123 Street Name'
          Town: 'Testing'
          County: 'Antrim'
          PostCode: 'BT7 1NT'
          Country: 'England'
          EmailAddress: 'donotsend@apvs.com'
          PhoneNumber: '012345678'
          _csrf: '{{ token.value }}'
        capture:
          header: 'location'
          as: madeVisitUrl
      - think: 2